Repository: cboos/trac-mypage-plugin
Catalog: tracext/wiki/locale/*/LC_MESSAGES/mypage.po
Languages: fr

source: The date of the day, formatted according to the user preferences
fr: La date du jour, présentée selon les préférences de l'utilisateur

source: The date of the day, formatted according ISO-8601 (i.e. YYYY-MM-DD)
fr: La date du jour, présentée selon la norme ISO 8601 (c.-à-d. aaaa-mm-qq)

source: The author's user id
fr: L'identifiant de l'utilisateur

source: The author's full name
fr: Le nom complet de l'utilisateur

source: Link to most recent `MyPage` page
fr: Lien vers la page « `MaPage` » la plus récente

source: Wiki text of the most recent `MyPage` page
fr: Texte wiki de la page « `MaPage` » la plus récente

source: Wiki-quoted text of the most recent `MyPage` page
fr: Citation du text wiki de la page « `MaPage` » la plus récente

source: MyPage
fr: MaPage

source: You need to be authenticated in order to use MyPage.
fr: Vous devez être identifié afin the pouvoir utiliser « `MaPage` »

source: Can't create the page of the day.
fr: Impossible de créer la page du jour.

source: Display help for `PageTemplates/MyPage/` usage.
fr: Affiche l'aide pour l'utilisation effective des patrons `PageTemplates/MyPage/`

source: The following tokens can be used in the `PageTemplates/MyPage` or `PageTemplates/MyPage/<user>` wiki pages:
fr: Les expressions suivantes peuvent être utilisées dans les pages wiki `PageTemplates/MyPage` ou `PageTemplates/MyPage/<user>` :

source: Note that you can also use the `[[MyPageNav]]` wiki macro for creating dynamic links to other ''MyPage'' pages (use `[[MyPageNav?]]` to get help on this macro).
fr: Vous pouvez également utiliser la macro-commande `[[MyPageNav]]` pour créer des liens dynamiques vers d'autres pages de type « `MaPage` » (utilisez `[[MyPageNav?]]` pour obtenir de l'aide sur cette macro).

source: Link to another `MyPage` page, with the current one taken as reference. It can take parameters of the form //`+-offset,]label`//. The `offset` is +0 by default, which means link to the current page. A value of `+1` means the ''MyPage'' coming immediately after the one containing the macro. Likewise, `-1` means the one immediately before. If the macro is placed on a page which is not a ''MyPage'' page itself, then this will take the page of the day for the reference point. Note that bigger numbers can be used for the offsets, so one can create links like: `[[MyPageNav(-100000,At the beginning)]]` and `[[MyPageNav(+100000,At the end)]]`.
fr: Créé un lien vers une autre page de type « `MaPage` », en utilisant la page courante comme point de référence. Des paramètres peuvent être fournis, suivant la syntaxe suivante : //+-offset,]label`//. L'`offset` est +0 par défaut, ce qui correspond à un lien vers la page courante. Une valeur de `+1` correspond à la page de type « `MaPage` » venant immédiatement après la page contenant la macro-commande. De même, `-1` correspond à la page de type « `MaPage` » venant immédiatement avant. Si la macro est insérée dans une page qui n'est pas une page de type « `MaPage` », alors c'est la page du jour qui sera utilisée comme point de référence. Notez que des valeurs arbitrairement grandes peuvent être utilisées en tant qu'`offset`, de façon à pouvoir créer des liens du type : `[[MyPageNav(-100000,At the beginning)]]` et `[[MyPageNav(+100000,At the end)]]`.

source: (at the end)
fr: (à la fin)

source: (at the beginning)
fr: (au début)
